app/Http/Controllers/Auth/AuthController.php

    private function findOrCreateUser($githubUser)
    {
        if ($authUser = User::where('github_id', $githubUser->id)->first()) {
---
select * from `users` where `github_id` = 54536701 limit 1