app/Http/Controllers/HikeController.php

select * from `hikes`
---
    public function index(Request $msg)
    {
        foreach($msg->request->all() as $message){
            switch($message){
                case "Success":
                    Session::flash('success', "La course été supprimé");
                    break;
                case "Add":
                    Session::flash('success', "La course été Ajouté");
                    break;
            }
          }
        $hikes = Hike::all();

select * from `equipment`
select * from `trainings`
select * from `destinations`
select * from `hikes`
---
    public function create(Request $request)
    {
        $equipment = Equipment::all();
        $trainings = Training::all();
        $destinations = Destination::all();
        return view('hikes.create', ['hike' => new Hike])->with(compact(['equipment','trainings','destinations']));

insert into `hikes` (`name`, `meeting_location`, `meeting_date`, `beginning_date`, `ending_date`, `min_num_participants`, `max_num_participants`, `difficulty`, `additional_info`, `drop_in_altitude`, `state_id`) values ('gob', 'Broc village', '0201-03-21 23:01', '2020-02-20 20:20', '2020-02-20 20:02', '21151', '32132131', '2', 'asdfasfasdfadfs', '231', 1)
---
    public function store(HikesPost $request){
            $newHike = new Hike;
            $newHike->name = $request->input('hikeName');
            $newHike->meeting_location = $request->input('locationRdv');
            $newHike->meeting_date = $request->input('dateRdv').' '.$request->input('timeRdv');
            $newHike->beginning_date = $request->input('dateHike').' '.$request->input('startHike');
            $newHike->ending_date = $request->input('dateHike').' '.$request->input('endHike');
            $newHike->min_num_participants = $request->input('minParticipants');
            $newHike->max_num_participants = $request->input('maxParticipants');
            $newHike->difficulty = $request->input('difficulty');
            $newHike->additional_info = $request->input('addInfo');
            $newHike->drop_in_altitude = $request->input('dropAltitude');

            // TO DO : Take the real state_id
            $newHike->state_id = 1;
            $newHike->save();

select * from `hikes`
---
    public function show($id){
        $hike = Hike::find($id);
        return view('hikes.show')->with(compact('hike'));

select * from `hikes`
---
    public function myHike(){
        /*
        Pas utilisé parce qu'avec cette requette il ne resort pas le guides et les destinations
        */
        /*
        $hikes = Hike::where('email_address', Auth::user()->email_address)
        ->join('hike_user', 'hike_user.hike_id', '=', 'hikes.id')
        ->join('users', 'hike_user.user_id', '=', 'users.id')
        ->select('*')->get();
        */
        $hikes = Hike::all();
        return view('home')->with(compact('hikes'));

select * from `equipment`
select * from `trainings`
select * from `destinations`
---
    public function edit($id)
    {
        $equipment = Equipment::all();
        $trainings = Training::all();
        $destinations = Destination::all();

delete from `hike_training` where `hike_id` = 6
---
    public function update(HikesPost $request, $id)
    {

        $hike = Hike::find($id);
        $hike->equipment()->detach();
        $hike->trainings()->detach();

select * from `destinations` where `location` LIKE '%f%'
---
    function fetch(Request $request)
    {
        if($request->get('query'))
        {
            $query = $request->get('query');
            $data = DB::table('destinations')
                ->where('location', 'LIKE', "%{$query}%") // location is the column name
                ->get();