app/Http/Controllers/HikeCalendarController.php

    public function index()
    {
        $hikes=Hike::all();
---
select * from `hikes`

    public function show($date)
    {
        $from = $date;
        $to = date('Y-m-d', strtotime($date . ' +1 day'));
        $dayHikes = Hike::whereBetween('beginning_date',[$from,$to])->get();
---
select * from `hikes` where `beginning_date` between '2020-04-22' and '2020-04-23'