app/Http/Controllers/MultiHikesController.php

select * from `users`
---
    public function index(){
      $users = User::all();
      return view('createMultiHikes')->with(compact('users'));

insert into `hikes` (`name`, `meeting_location`, `meeting_date`, `beginning_date`, `ending_date`, `min_num_participants`, `max_num_participants`, `difficulty`, `additional_info`, `drop_in_altitude`, `state_id`) values ('Test 1', 'Broc', '2020-03-13', '2020-03-26 12:00', '2020-03-26 13:00', '1', '1', '1', '1', '1', 1)
---
          $hike->additional_info = $request->input('info')[$i];
          $hike->drop_in_altitude = $request->input('altitude')[$i];
          $hike->state_id = 1;
          $hike->save();